[
  {
    "name": "Youlens",
    "minidescription": "Youlens est une application web créée pour un vidéaste et photographe spécialisé dans le mariage.",
    "description": "Projet Professionnel, Vidéaste et photographe",
    "details": "Ce projet consistait à créer l'application web responsive Youlens, vidéaste et photographe spécialisé dans le mariage à partir de maquettes. Youlens est une application codée en ReactJS qui regroupe une gallerie d'images, un slider ainsi qu'un formulaire de contact avec envoi de mail automatique en back-end.",
    "img": ["../img/youlens.webp"],
    "link": ["https://youlens.fr"]
  },
  {
    "name": "Gaec Chimounet",
    "minidescription": "Gaec Chimounet est le site web d'une entreprise de maraîchage bio.",
    "description": "Projet Professionnel, Maraîcher Bio",
    "details": "Ce projet consistait à créer l'identité visuelle complète de la marque en passant par le logo, le site web responsive, les cartes de visite ainsi que les étiquettes de leurs produits transformés. Le site est statique en HTML, CSS pour le moment. Il comporte un formulaire d'envoi de mail automatique en php ainsi qu'une gallerie d'images.",
    "img": ["../img/gaecchimounet.webp"],
    "link": "https://gaecchimounet.fr"
  },
  {
    "name": "HR Net",
    "minidescription": "Cette application web est faite pour faciliter la création et la gestion de fiches employés de l'entreprise HRNet.",
    "description": "Projet de formation",
    "details": "Ce projet consistait à créer une interface de création de fiches employés pour une entreprise. Grâce à celle-ci, les données entrées sont enregistrées dans la base de données. La seconde page 'Current Employees' permet de visualiser les fiches employés dans une tableau. Dans ce tableau, il est possible de rechercher un employé en particulier, d'afficher plus ou moins de résultats et de trier et filtrer par ordre alphabétique ou par date d'entrée dans l'entreprise. J'ai migré cette app de jQuery vers ReactJS et TailwindCSS pour de meilleurs performances.",
    "img": ["../img/hrnet-create.webp", "../img/hrnet-current.webp"],
    "link": "https://p14-hr-net-nu.vercel.app/"
  },
  {
    "name": "Pluggin NPM",
    "minidescription": "Ce pluggin permet d'ouvrir une modale qui se ferme automatiquement après un certain temps.",
    "description": "Projet de formation",
    "details": "Dans le cadre du projet HRNet, j'ai aussi créé un pluggin npm personnalisable (auto-close-modal) qui est une modal qui se ferme automatiquement après un certain temps et qui affiche le succès de création de la fiche employé.",
    "img": ["../img/npm2.webp", "../img/npm.webp"],
    "link": "https://www.npmjs.com/package/react-auto-close-modal"
  }
]